artillery-load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Search queries"
    weight: 40
    flow:
      - get:
          url: "/api/search/prod?q=nike"
          capture:
            - json: "$.cached"
              as: "cached"
      - log: "Search cached: {{ cached }}"

  - name: "Product pages"
    weight: 30
    flow:
      - get:
          url: "/api/product/11111111-1111-1111-1111-111111111111"
          capture:
            - json: "$.cached"
              as: "cached"
      - log: "Product cached: {{ cached }}"

  - name: "Category pages"
    weight: 20
    flow:
      - get:
          url: "/api/category/shoes?page=1&limit=20"
          capture:
            - json: "$.cached"
              as: "cached"
      - log: "Category cached: {{ cached }}"

  - name: "Facets"
    weight: 5
    flow:
      - get:
          url: "/api/facets"

  - name: "Trending"
    weight: 5
    flow:
      - get:
          url: "/api/trending"